app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Arqh"], ["room_number", 56], ["created_at", "2020-11-23 00:33:40.356275"], ["updated_at", "2020-11-23 00:33:40.356275"]]
---
    def create
        @school_class = SchoolClass.create(school_params(:title, :room_number))

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "school_classes" SET "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["room_number", 25], ["updated_at", "2020-11-23 00:51:16.182459"], ["id", 2]]
---
    def update
        @school_class = SchoolClass.find(params[:id])

        @school_class.update(school_params(:title, :room_number))